require('dotenv').config();

const {Telegraf} = require('telegraf');
const bot = new Telegraf(process.env.BOT_TOKEN);
const {Keyboard, Key} = require('telegram-keyboard')

bot.start((ctx) => ctx.reply('Привіт! Я буду надсилати тобі розклад OwO'));

bot.command('today', (ctx) => {
  let currentDay = new Date().getDay();
  console.log(currentDay);
  switch (currentDay) {
    case 0:
      ctx.reply('Понеділок \n\n 1: Осн. екон. теор.\n Викладач: Зіміна О. В. \n\n 2: Фіз. вих.\n Викладач: Барська М. В. \n\n 3: Буд. та експл. А і Т\n Викладач: Романчук О. В. \n\n 4: Мікропр. техн.\n Викладач: Мірошниченко В. Л.')
      return;
    case 1:
      ctx.reply('Понеділок \n\n 1: Осн. екон. теор.\n Викладач: Зіміна О. В. \n\n 2: Фіз. вих.\n Викладач: Барська М. В. \n\n 3: Буд. та експл. А і Т\n Викладач: Романчук О. В. \n\n 4: Мікропр. техн.\n Викладач: Мірошниченко В. Л.')
      return;
    case 2:
      ctx.reply('Вівторок \n\n 1: Осн. ох. праці\n Викладач: Шмаюк Л. А. \n\n 2: Метрол. та вимір.\n Викладач: Лук*яненко В. В. \n\n 3: Осн. кер. авт.\n Викладач: Рольський М. Я. \n\n 4: Осн. психолог.\n Викладач: Заболотна М. О.')
      return;
    case 3:
      ctx.reply('Середа \n\n 1: Осн. кер. авт.\n Викладач: Рольський М. Я. \n\n 2: Фіз. вих.\n Викладач: Барська М. В. \n\n 3: Укр. мова за проф.\n Викладач: Гаврилець А. О.')
      return;
    case 4:
      ctx.reply('Четвер \n\n 1: Осн. ох. праці\n Викладач: Шмаюк Л. А. \n\n 2: Ел. уст. А і Т\n Викладач: Колібабчук В. І.\n\n 3: Мікропр. техн.\n Викладач: Мірошниченко В. Л. \n\n 4: Іноз. мова\n Викладач: Закревська А. К / Чала В. П.');
      return;
    case 5:
      ctx.reply('П*ятниця \n\n 1: Електроуст. A та Т\n Викладач: Колібабчук В. І \n\n 2: Буд. та експ. А і Т\n Викладач: Романчук О. В. \n\n 3: Метрол. та вимір.\n Викладач: Лук*янеко В. В.')
      return;
    case 6:
      ctx.reply('Понеділок \n\n 1: Осн. екон. теор.\n Викладач: Зіміна О. В. \n\n 2: Фіз. вих.\n Викладач: Барська М. В. \n\n 3: Буд. та експл. А і Т\n Викладач: Романчук О. В. \n\n 4: Мікропр. техн.\n Викладач: Мірошниченко В. Л.')
      return;
    default:
      ctx.reply("Error owo");
      return;
  }
})

bot.command('/week', async (ctx) => {
    const keyboard = Keyboard.make([
      ['Пн', 'Вт', 'Ср', 'Чт', 'Пт']
    ])
  await ctx.reply('На який день прислати розклад?', keyboard.reply())
    .then((reply) => {

    })
})

bot.launch();